[
    {
        "id": "ai_and_streaming",
        "title": "AI و بڵاوکردنەوە: نوێترین هاوکاتەکان",
        "subtitle": "چالاکیە نوێکان لە زانستی AI و بڵاوکردنەوە",
        "content": "AI و خزمەتگوزاریەکانی بڵاوکردنەوە گۆڕانکاری زۆرییان کردووە. سام ئالتمن، بەڕێوەبەرە گشتییەکەی OpenAI، ئیتر باوەڕی نییە ئەوەی AGI (زانستی گشتیی ئەندامە گشتییەکان) ئەو کەڵکەی پێشتر هەژمار کراوە دابنێ. هەرواە بەردەوامە بە کاربەرکردنی بەرزکردنەوەیەکە بۆ AI بە نرخێکی مانگانی ٢٠٠ دۆلار.\n\nگووگڵ و ئەمەزوون بەردەوامن بە پاراستنی زانستە بەرزەکان بەرەوپێش بەرین، بەڵام AI یەکان هەیە تا ئێستا کێشەیانی لەناو دڵنیابوون و ڕاستبوونەوە.\n\nزانیاریە زانست و بڵاوکردنەوە زۆر گۆڕاوە—لە پاشدا زۆر بەردەوام دەبێت!",
        "takeaway": "AI لە بڵاوکردنەوەدا زۆر گۆڕاوە، هەوڵبدەرەوە بەرزکردنەوەکان بەپڕۆژە نوێکان ڕاست بکەیتەوە.",
        "image_url": "photo/1.jpg"
    },
    {
        "id": "climate_action",
        "title": "کارەکان بۆ گۆڕینی ئابووری هەوا",
        "subtitle": "چالاکییە گەورەکان بۆ پاراستنی بەرەوپێشبوونی جیهانی",
        "content": "گوندی نێودەوڵەتی تایبەتمەندین بە چالاکیەکانی ئابووری هەوا. زۆربەی وڵاتەکان یەکگرتووە و پڕۆژەکان بەرەوپێش دەبرن بۆ گەیاندنی گەشەی بەردەوام.",
        "takeaway": "گوندی نێودەوڵەتی گەرەکی زۆرییە، هەوڵبدەرەوە پاراستنەوەکان نوێ بکەیتەوە بۆ ئەندامی کۆمەڵەیەکی ئافرەتابی.",
        "image_url": "photo/2.png"
    },
    {
        "id": "چۆنیەتی_دروستکردنی_شتێکی_تایبەت_بۆ_تەلەگرامەکەم",
        "title": "چۆنیەتی دروستکردنی شتێکی تایبەت بۆ تەلەگرامەکەم",
        "subtitle": "تایبەت بە کەناڵی تەلەگرامەکەم",
        "content": "ئەمڕۆ بڕیارمدا هەواڵنامەیەکی تایبەت بە کەناڵەکەم دروست بکەم، کە تێیدا دەتوانم ئەوەی لە مێشکمە بە باشترین شێوە بۆتان بنوسم و بۆتان دەربخەم لە ئارتیکلێلی جواندا چونکە ئێوە شایەنی باشترینن.\n\nلەماوەی ڕابردوو توانای پڕۆگرامینگم زۆر باش چووە پێشەوە، دەتوانم لەماوەی چەند کاتژمێرێك پرۆگرامێك دیزاین بکەم، هاوشێوەی ئەمە، کە بەشێوەیەکی جوان دەتوانێت ئارتیکلەکانم بڵاو بکەمەوە.",
        "takeaway": "دواتر بزانم ئەم ئارتیکلەکان چۆن بە شێوەیەکی باشتر پیشاندەبمەوە؟ چی پێویستە زیاد بکرێت؟",
        "image_url": "photo/telegram.jpg"
    }
]