[
    {
        "id": "هاوکار_پۆرتاڵێکی_تایبەت_بە_کەناڵی_تەلەگرامەکەی_دروست_دەکات",
        "title": "هاوکار پۆرتاڵێکی تایبەت بە کەناڵی تەلەگرامەکەی دروست دەکات",
        "subtitle": "پۆرتاڵێك تایبەت بە نوسینی بلۆگ و بیرۆکەکانی تاوەکو بتوانێت زیاتر سود بە کۆمەڵگە بگەینێت",
        "content": "---\n\nماوەیەکی زۆرە بابەت نوسینم وەستاندبوو، چونکە لەناو پڕۆسەیەکی *ڕاگواستنەوەبووم*، بەخێرایی لەناو *فێربووندابووم*، توانایەکی نوێم بەدەست دەهێنا. لەم توانایە بەتەواوی *تێڕوانین* و *بیرکردنەوەم* لەگەڵی گۆڕانکاری بەسەردادەهات! **کۆدینگ**، **پرۆگرامینگ**، یاخود **پڕۆگرامسازی**؛ ساڵی *٢٠٢٤* بە قوڵی کەوتمە ناو پڕۆگرامسازی، هەر ئەوەش وایکرد کە ئەمن نەمدەتوانی بڵێم ئێستا چ دەگوزەرێت لەلای خۆم چونکە ڕۆژ بە ڕۆژ شتەکی تازە فێردبووم.\n\n---\n\n### سەبارەت بە کەناڵی تەلەگرامەکەم\n\nزۆربەی جار پرسیاری ئەوەم لێدەکرا:  \n**لەبەرچی گرینگی بە زیادبوونی فۆڵۆوەرەکان نادەی؟**\n\nهەمووجار لەناو ناخم شتەك دروست دەبوو، ئەویش حەقیقەتی *مانیفێستەیشنی من بۆ کۆمەڵگە* یەکسانە بە ژمارەی فۆڵۆوەرەکان. ئەگەر من شتێكی پڕ بایەخ نەدەمە ناو کۆمەڵگە، فۆڵۆوەر زیادبوون شتێکی ئاسان نابێت.  \nحەزیشم نەکردووە کە بە پاڵپێوەنان شتەکان ببەمە پێشەوە. بەڵام لەگەڵ ئەوەش، بیرم لەوەی دەکردەوە کە پلاتفۆرمێکی *دروستکردنی بلۆگم* هەبێت زۆر ئاسانبێت، بتوانم خۆم *کۆنترۆلم* لەسەر هەبێت.  \nلەم پلاتفۆرمە *تێڕوانینەکانم*، بابەتە نوێگەریەکانم، تێیدا بخەمەڕوو.\n\n---\n\n### ئەمڕۆ پۆرتالی هاوکارتان پێ دەناسێنم  \n\nتێیدا دەتوانم *باشتر بیرۆکەکانم بخەمەڕوو*، باشتر پێتان بگەینم.  \n**ئەم پۆرتالە خۆم کۆدم کردووە**، زیاتریش کۆدی دەکەم، وای لێدەکەم کە ئێوە زیاتر چێژ لە خوێندنەوەی ئەم پۆرتالە وەرگرن.\n\n---\n",
        "takeaway": "دواتر بزانم ئەم ئارتیکلەکان چۆن بە شێوەیەکی باشتر پیشاندەبمەوە؟ چی پێویستە زیاد بکرێت؟",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733571460_telegram.jpg"
    },
    {
        "id": "کاتێك_دەتەوێت_سکریپتێك_لەگەڵ_چاتجیپیتی_ببەیە_پێشەوە،_قەت_ئەم_هەڵانە_مەکە",
        "title": "کاتێك دەتەوێت سکریپتێك لەگەڵ چاتجیپیتی ببەیە پێشەوە، قەت ئەم هەڵانە مەکە",
        "subtitle": "چاتجیپیتی دەتوانێت وەڵامی هەموو شتێکت بداتەوە، بەڵام ئەگەر ئاگات لێی نەبیت، وەڵامەکان دەستغەڵەتت دەدات",
        "content": "کاتێك دەکەویە گفتوگۆ، سریپتێکی داوا لێدەکەی، لەبۆت دروست دەکات، دواتر دەچیت تێستی دەکەی، دەبینی ئەم سکریپتە چەندین گرفتی هەیە، هەرگیز هەوڵمەدە داوای لێبکەی هەموو گرفتەکانی سکریپتەکەت بۆ چارەسەر بکات. باشترین ڕێگە بریتیە لەوەی کە تەنها یەك گرفت هەڵبژێریت، داوای لێبکەیت بۆت چارەسەر بکات، دوای ئەوەی کە بینیت ئەم گرفتە چارەسەربووە، ئینجا بڕۆ سەر گرفتێکیتر. کاتێك تۆ بەیەکەوە داوای لێدەکەی هەموو گرفتەکانت لەبۆ چارەسەر بکات، کارامەیی لەدەست دەدات، تەواوی ڕوحیەتی سکریپتەکەت دەگۆڕێت. بەم ڕێگایە کاتێکی زۆرتر بەسەر دەبەیت، بەڵام بەردەوام مۆدێلی سکریپتەکەت لەبەرەوپێشچوونە، زیرەکتر و کارامەتر دەبێت.\n\n\nنمونەکان\nPrompt: I like the script, but can you change the sidebar style to the button?\nPrompt: Good, now can you handle invalid inputs gracefully?\nPrompt: I like it! Now, can you allow the user to calculate squares repeatedly until they decide to stop?\n",
        "takeaway": "هەر کاتێک سکریپتێکت پێویستە، تەنها یەک گرفت دیاریبکە و داوای چارەسەری لێ بکە.\nئەوەیە باشترین ڕێگە بۆ ئەوەی سکریپتەکەت زیرەتر و کاریگەرتر بێت.\nکاتێک هەموو گرفتەکان بە یەک کات دەستنیشانبکەی، کارامەییەکان دابەزێنەوە.\nگفتوگۆکردن بە چاتجیپیتی بایدە پەیوەندیداری دروست و ڕاستەوخۆ بێت بۆ بەدەستهێنانی ئەنجامی باش.",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733588079_ai.jpg"
    },
    {
        "id": "ڕێکخستنی_وزە_و_کاتت_بۆ_گەیشتن_بە_لوتکەی_بەرهەمداربوونت",
        "title": "ڕێکخستنی وزە و کاتت بۆ گەیشتن بە لوتکەی بەرهەمداربوونت",
        "subtitle": "کۆرسێکیتر لە کۆرسەکانی هاوکار، کار لەسەر بەرەوپێشبردنی کات و وزە و توانات دەکات",
        "content": "کۆرسی ڕێكخستنی و وزە و کاتم دەستپێکرد، کۆرسەکە بەوەی دەستپێدەکات سەرەتا تاقیکردنەوەیەکی ئەو کەسە دەکەم کە دەیەوێت کۆرسەکە ئەنجام بدات، تاقیکردنەوەکە لەسەر دۆخی ئاگایی و رۆتین و چاڵاکی و چۆنیەتی ژیانی ئەو کەسەیە. چەند پرسیارێکی ئاڕاستە دەکرێت، تاوەکو دۆخی ئێستای کەسەکە دەستنیشان بکرێت. دواتر بەشێوەیەکی زیرەکانە هەڵسەنگاندن بۆ دۆخی کەسەکە دەکریت، پێی دەگوترێت لە چەند لایەندا ئەم کەسە لە دۆخێکی باش دایە، چی بکات تاوەکو بگاتە لوتکەی تواناکانی؟ ئینجا پێشنیاری ئەو شتانەی لەبۆ دەکات کە دەیگەیەنێتە لوتکەی تواناکانی.\n\nچۆن ئەم سیستەمەم دامەزراند؟\nبیرم کردەوە لەسەر ئەوەی ئایا من چی دەەکەم؟ ئەزموونی سەرکەوتنی من لە چی دایە؟ بە جۆرێك لە جۆرەکان دۆخی خۆم کردووە بە وانە و فێربوون، لەگەڵیشیدا، چەند توێژینەوە و نوسینێكی تایبەت بە ڕێکخستنی وزەم لەبەرچاو گرتووە. هەموو ئەوانە بەیەکەوە پێم دەڵێن ئەگەر دۆخی وزەی کەسێك باش بکەی تا ئاستی لوتکەی بەکارهێنانی تواناکانی، ئەوە پێویستی بەم ستراتیجیە هەیە تاوەکو بگاتە ئەم ئەنجامە.\n\nکێ پێویستی کۆرسی وزە هەیە؟\nئەو کەسانەی بەدوای ڕێکخستنی کات و وزە و بەهێزکردنی تواناکانیان دادەگەڕێن سود لەم کۆرسە وەردەگرن، ئەوانە دەتوانن بەشداربن و کۆرسەکە وەربگرن بەشێوەی ئۆنلاین.\n\nئەو کەسەی کە بەشداردەبێت، سودمەند دەبێت لە گرتنەبەری ڕێچکەیەك کە دەتوانێت بەرهەمدارتربێت، خۆڕاگرتربێت، هەروەها زیاتر بتوانێت بچێتە پێشەوە.\n\n\n\n\n![Image Description](https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733768177_personal.jpg)\n",
        "takeaway": "ئەو کات و وزەیەی کە ئێمە هەیتمان سنوردارە، ئەو ئەرکانەی ئێمە هەیتمان دەگۆڕدرێت، چۆن بتوانین بەرهەمدارترین ئەركمان بخەینە ئەو کاتانەمان کە زۆرترین وزەمان هەیە؟ چۆن جۆری ئەرکەکانمان بناسینەوە؟ چ جۆرە ئەرکێکن؟ وزەیان زۆر دەوێت یاخود کەم؟ ئەگەر وزەیان کەم دەوێت بخەینە ئەم کاتانەی کە وزەیەکی کەممان هەیە. ئەو ئەرکانەشی وزەیان زۆر دەوێت بخەینە ئەو کاتانەمان کە وزەمان زۆرە. ئەو کاتانەمان بناسینەوە کە وزەمان زۆرە؟ چۆن بتوانین ئەو کاتانەی کە وزەمان زۆرە، درێژتری بکەینەوە؟ ئەمە هەموو پرسیارە گرینگەکانی ئەم کۆرسەیە، کەسی بەشداربوو  دەچێتە قوڵایی ئەم فێربوونانە. ",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733768231_Gemini_Generated_Image_98wyfa98wyfa98wy.jpg"
    },
    {
        "id": "لە_قوتابیەکی_بێ_سکۆلەرشیپ_بۆ_وەرگرتنی_پۆستی_مامۆستای_زانکۆ",
        "title": "لە قوتابیەکی بێ سکۆلەرشیپ بۆ وەرگرتنی پۆستی مامۆستای زانکۆ",
        "subtitle": "چیرۆکی خۆم باس دەکەم کە چۆن دەستم بەم دکتۆرایەکرد، چۆن توانیم متمانەی زانکۆ بەدەست بهێنم",
        "content": "کاتێك دەستم بە قۆناغی دکتۆراکرد، لەسەر تێچووی خۆم هاتمە زانکۆیەکی ئەوڕوپی، قورسبوو لەسەرم، پێموابوو کە سکۆلەرشیپێکی ئەو وڵاتە وەردەگرم، دەمگۆت قەینا لەسەر بودجەی خۆشمبیت لێرە دەبم، ئەوەبوو من لە هەنگاریابووم، دەمخوێند، چاوەڕێی ئەم سکۆلەرشیپەم کرد، دوای نزیکەی نۆ مانگ لە چاوەڕوانکردن، ئەنجامەکەی نەرێنیبوو، وەرنەگیرام. دواتر توێژینەوەیەکی بچوك هەبوو هەر لە بەشەکەمان، ئەمنیش بەشداریم کرد، بەهۆی ئەو توێژینەوەیەی هەندەك تێچووم لەسەر کەمبووەوە. لەگەڵیشیدا خەریکی سکۆلەرشیپێکیتری ئەوڕوپیبووین، ئەویش دوای چەندین مانگ هەر ناوم نەگەڕایەوە.\n\nلەناو قۆناغی خوێندنی دکتۆرابووم، دەستم بەم پیشەیە کرد وەکو توێژەرێك لە بوارەکەی خۆم، ئەوپەڕی توانای خۆم خستبووەگەڕ، ئەوەبوو لە چوار توێژینەوەی ئاست بەرز بەشداریم کرد، لە چەند پڕۆژەیەك بەشداریم کرد، لەناو بەشەکەمان بەتەواوی ناسرابووم کە من دەتوانم پایثۆن و زیرەکی دەستکرد بەکار بهێنم.\n\nکۆتایی هەفتەی ڕابردوو سەرۆکی فاکەلتیەکەمان لەگەڵم دانیشت، پێشنیاری دەرفەتێکی بۆ کردم، گوتی یاریدەدەرێکی پرۆفیسۆرمان دەوێت کە لە بواری جیۆلۆجی و ژیری دەستکرد کاری کردبێت، پێشنیاری تۆمان بۆ کراوە، دەزانم تۆ لە قۆناغی کۆتایی دکتۆرایەکەتدایت، ئێمە هەموو هەوڵێك دەدەین کە دکتۆرایەکەت بە سەرکەوتووی تەواوبکەیت، بەڵام دەتوانیت لە ئێستاوە ئەم دەرفەتە وەرگریت. ئەمڕۆ ڕەزامەندبوونی خۆم دەرخست لەبۆیان، ئەوانیش دەستیان کرد بە پڕۆسەی دەستکردن بە دامەزراندنم لەم بوارە بەشێوەیەکی درێژخایەن. ئەوان پێشبینی ئەوەم لێ دەکەن کە سەرۆکایەتی تیمێکی توێژینەوەی زیرەکی دەستکرد بکەم، گرانتی نوێی بۆ بەشەکەیان بهێنم، هەروەها چەند وانەیەك هەیە بدەمەوە بە زمانی هەنگاری.\n\nزانکۆی سەگەد یەکەمین زانکۆی هەنگاریایە لە ئاست بەرزی، دوو خەڵاتی نۆبلی هەیە، لەناو ڕیزبەندی سەد زانکۆی جیهانە لە سەوزترین زانکۆ. بەتەواوەتی پشت بە جیۆثێرمال دەبەستێت بۆ گەرمبوونەوە. لەم زانکۆیە چەندین کورد ماستەر و دکتۆرایان خوێندووە.\n\nپرسیارەکە ئەوەیە؛ ئایا چۆن لە بێگانەیەکی بێ سکۆلەرشیپ لە وڵاتێکی ئەوڕوپی بۆ پێدانی متمانەی بەرزترین ئاستی ئەکادیمیا؟ لەوانەیە نهێنیەکە بریتیبێت لەوەی کە ئەم ساڵ بەتایبەت توانیبم هەندێك ئەرکی زۆر گەورە ئەنجام بدەم. ئەوان پشتڕاستیان کرەوە گوتیان بیستومانە کە تۆ کارت لەسەر Big Data کردووە، بۆیە بەلامانەوە زۆر گرینگە کە دەرفەتێکی لەم شێوەیە بدەینە تۆ. دەتوانم بڵێم من زۆر بە  خێرایی خۆم فێری پایثۆن کرد و پڕۆژەم بە پایثۆن ئەنجامدا، پڕۆژەکانیشم سەرکەوتووبوو، بۆیە ئەم کاریگەریەیان دروستکرد. \n\nهەندێك لەو شتانەی کە دڵیان خۆشم کردم، دوو سێ پڕۆفیسۆری ئەم زانکۆیە پێیان گوتم ئێمە دەزانین تۆ چەند بە قورسی دەستت پێکرد، ئێستاش دەبینین کە زانکۆیەکەمان چەند پێویستی بە توانای تۆ هەیە. پێیان گوتم دەمانەوێت بە خێرایی دکتۆرایەکەت تەواوبکەی، هەرچیت پێویستە پێمان بڵێ. ئەوان پێشبینی ئەوەم لێدەکەن ساڵی داهاتوو بە زمانی هەنگاریش وانەی بەکالۆریۆس بدەمەوە.\n\n\n\n\n",
        "takeaway": "لەم چیرۆکەم دەتوانم بڵێم گرینگترین شت ئاماژەی پێبدەم ئەوەیە کە من وەبەرهێنانێکی چەند ساڵیم کردووە لە دروستکردنی متمانە لە دەوروبەری خۆم، ئێستا ئەم متمانەیەم بویتە هۆی ئەوەی گڵۆپی سەوزم بۆ دابگیرسێنن، کە خۆم زیاتر ببەمە پێشەوە.  ",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733772316_szeged.jpg"
    },
    {
        "id": "بەڕێوەبەرەکەت_تەنها_دەیەوێت_تۆ_ئەرکەکانت_بە_باشی_ئەنجام_بدەیت",
        "title": "بەڕێوەبەرەکەت تەنها دەیەوێت تۆ ئەرکەکانت بە باشی ئەنجام بدەیت",
        "subtitle": "فێربە ژێرخانێکی تۆکمە بۆ باشتر بەڕێوەبردنی ئەرکەکانت دروست بکە",
        "content": "کاتێك تۆ کار لەسەر ئەرکەکانت دەکەیت، هەموو ئەرکێکت دوو بەشی زۆر گرینگی هەیە؛ بەشی ژێرخان و زەمینەکەی، بەشی بەڕێوەچوونەکەی. دەتوانم بڵێم بەشی ژێرخان و زەمینەکەی لە لامان زۆر گرینگ نیە، هەر بۆیەش ئێمە تەنها بەڕێوەچوونەکەمان بەلاوە گرینگە. ئەگەر ژێرخانی ئەرکەکەت بەهێزبوو، کوالیتی بەڕێوەچوونەکەشی باشتر دەبێت، زۆربەی جار بەڕێوەبەرەکەت بەلایەوە گرینگ نیە تۆ چۆن ئەندازیاری بۆ ئەرکەکانت ئەنجام دەدەیت، چونکە بەڕێوەبەرەکەت تەنها بەلایەوە گرینگە تۆ ئەرکەکەت ئەنجام بدەیت. بەڵام بۆخۆت زۆر گینگە کە ژێرخانی ئەرکەکانت هەبیت.\n\nمەبەستم چیە لە ژێرخان؟ ئایا تا چەند ئەرکەکەت پلانی بۆ دادەنێی، پێش ئەوەی ئەنجامی بدەیت. بیخەیتە ناو نەخشەیەك، بۆت دەربکەوێت ئایا ئەرکەکەت لە چەند ئەرکی بچوك پێکهاتووە؟ ئایا هەر کام لەم ئەرکە بچوکانە چۆن دەتوانیت ئەنجامیان بدەیت؟ کێ دەبێت ئەنجامیان بدات؟ بۆ هەر ئەرکێكی گەورەت، زۆر ئاساییە ئەگەر یەك لەسەر پێنجی کاتەکەت بۆ ژێرخانی ئەرکەکەت تەرخان بکەیت. ئەم بڕە کاتە وەکو وەبەرهێنانی کاپیتالە بۆ ئەرکەکانت.\n\nمن نەخشەسازی بۆ ئەرکەکانم دەکەم، ئەوانەی لەگەڵم کار دەکەن، نەخشەکەی خۆم بۆیان دەردەخەم، تەواوی کەلێنەکانیان پشان دەدەم، زیاتر دێنە ناو بیرکردنەوەم، دەزانن کە من چۆن بیردەکەمەوە. بەخۆم دەزانم من دەبێت چی بکەم. هەر بۆیە دەتوانم بڵێم کاتێك گەیشتمە ئەو قۆناغەی ئەرکەکانم بە نەخشەسازی و ژێرخان ئەنجامدا، لەم قۆناغە کوالیتی ئەرکەکانم چووە پێشەوە، متمانەی دەوروبەرم بەمن چووە پێشەوە.\n\nبەڵام پرسیاری گرینگ ئەوەیە: ئایا چۆن لە وۆركفلۆیەکەم جێگەی ئەوانیتر بکەمەوە، چۆن وابکەم کە من تەنها خۆم کار لەسەر ئەم وۆرکفلۆو نەکەم، بەڵکو چەند کەسێکیتریش لەگەڵم بەشداربن. دەکرێت بەشێكی کەم لە وۆرکفلۆیەکەت کەسێکیتر بۆت بکات، یاخود چەند کەسێك بەشداربن لە چەندین بەشی جیاواز لە وۆرکفلۆیەکەت، ئەگەر توانیت ئیدارەی ئەم ئاستە بکەیت، ئەوە تۆ لە ئاستی بەڕیوبەری.\n\n\n\n\n\n\n![Image Description](https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733776129_workflow.jpg)",
        "takeaway": "ئەگەر توانیت ژێرخان بۆ ئەرکەکانت دروست بکەیت، ئەوە کوالیتی ئەرکەکانت باشتر دەبێت. ئەگەر توانیت نەخشە بۆ ئەرکەکانت دروست بکەیت، ئەوە ئەوانیتر باشتر لە تو تێدەگەن کە تۆ چیت دەوێت. لەبۆی هەیە، بەشداربن لە سەرخستنی ئەرکەکانت. ",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733776129_workflow.jpg"
    },
    {
        "id": "من_باسی_تەقینەوەی_گڕکان_دەکەم_یاخود_دۆخی_سوریا؟",
        "title": "من باسی تەقینەوەی گڕکان دەکەم یاخود دۆخی سوریا؟",
        "subtitle": "چیرۆکی بەندبوونی شاخەکان لەناو ناخی زەوی، ئازادبوونیان، هاتنە دەرەوەیان",
        "content": "هەناوی زەوی خۆی بریتیە لە بەندیلخانەیەكی گەورە، بۆ ملیۆنان ساڵ شاخەکان لەناویدا بەندکراوە، لەناو ناتوانن لێی ڕابکەن، لەناو پەستان و فشار و پاڵەپەستۆ و گەرمیێکی زۆردان. بەردەوام شاخ و پاشماوەی زەوی زیاتری بۆ دێتە ناو. بەڵام دواجار هەناوی زەویش تا کۆتایی وەکو بەندیلخانە نامینێتەوە، هەر بزانە درزێكی تێکەوت، لەپڕێك گڕکان ڕوودەدات، ئەو شاخ و کێوانەی بە ملیۆنان ساڵ ڕووچووبوون، جارێکیتر ئازاد دەبن، دێنەوە دەرێ، بەسەر زەوی بڵاو دەبنەوە. دەچنەوە سەر بنەڕەتی خۆیان، لە بەندیلخانە ملیۆن ساڵیەکە ڕزگاریان دەبیت، دێنەوە سەر خاك.\n\nئەمەی باسم کرد، سیستەمێکی جیۆلۆجیە، کە بەشێوەیەکی بەردەوام دووبارە دەبێتەوە، شاخەکان بەریەك دەکەون، لەسەر ئاستی کیشوەری پێکهاتەی شاخەکان ڕوودەچنە ناو زەوی، گیر دەخۆن، دەتوێنەوە، دواتر بە گڕکان دێنە دەرەوە. ئەم ڕووداوانە لە سروشتدا ڕوودەدەن! ڕووداوەکانی ناو خۆمان هەر ئەم سروشتەمان بەبیر دەهێننەوە، فەرموو سەیری دۆخی ئەم دواییەی سوریا بکە، چەند دڵت پڕدەبوو کە هەزاران کەسی تێدابوو بۆ ماوەی دەیان ساڵ لە بەندیلخانەبوون، دیمەنی هاتنە دەرەوەی هاوڵاتیەکان وەکو دیمەنی گڕکارنەکە دەهاتە بەرچاوم، وەکوی ئەوەی گڕکانێك تەقیبێتەوە، چۆن لە تەقینەوەی گڕکان هەموو ئەو بەردانەی دێنە دەرەوە ماندی و شەکەتن، ئەوانیش بەو شێوەیە ماندی و شەکەتبوون.\n\nدوای هەر گڕکانێك کە ڕوودەدات، بەتەواوی جیۆلۆجیای ناوچەکە دەگۆڕدرێت، دەبێتە ناوچەیەکیتر لە ڕووی جیۆلۆجیاوە، لە ڕۆژ و شەوێك دەبێت جیۆلۆجیاکە جارێکیتر بنوسرێتەوە، دۆخی سوریا وەکو دۆخی گڕکانێكبوو، لە پڕێك تەقیەوە، لە پڕێك بووە دۆخێکیتر. دوای هاتنی گڕکان، دەکرێت کاتێکی زۆری بوێت تاوەکو دۆخەکە جێگیر دەبیت، کەشوهەوایەکە ئارام دەبێتەوە، بەڵام هەر چاپتەرێکی نوێیە، جیایە لەپێشخۆی، دەرفەت و ئالنگاری و گرفتی تایبەت بەخۆی هەیە.\n\n\n\n\n\n\n\n![Image Description](https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733862076_volcano.jpg)",
        "takeaway": "سروشت پڕە ڕووداوی سەیر، ئەگەر وەکو چیرۆك باس بکرێت، زۆر لە ڕووداوەکانی خۆمان دەچێت. تەقینەوەی گڕکان چیرۆکێکی ملیۆنان ساڵیە، شاخەکان لەناو ناخی زەوی بەند دەبن، گیر دەخۆن، دواتر لە دەرفەتێك هەر دێنەوە دەرێ، ماندی و شەکەت دەبن.",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733862076_volcano.jpg"
    }
]