[
    {
        "id": "هاوکار_پۆرتاڵێکی_تایبەت_بە_کەناڵی_تەلەگرامەکەی_دروست_دەکات",
        "title": "هاوکار پۆرتاڵێکی تایبەت بە کەناڵی تەلەگرامەکەی دروست دەکات",
        "subtitle": "پۆرتاڵێك تایبەت بە نوسینی بلۆگ و بیرۆکەکانی تاوەکو بتوانێت زیاتر سود بە کۆمەڵگە بگەینێت",
        "content": "---\n\nماوەیەکی زۆرە بابەت نوسینم وەستاندبوو، چونکە لەناو پڕۆسەیەکی *ڕاگواستنەوەبووم*، بەخێرایی لەناو *فێربووندابووم*، توانایەکی نوێم بەدەست دەهێنا. لەم توانایە بەتەواوی *تێڕوانین* و *بیرکردنەوەم* لەگەڵی گۆڕانکاری بەسەردادەهات! **کۆدینگ**، **پرۆگرامینگ**، یاخود **پڕۆگرامسازی**؛ ساڵی *٢٠٢٤* بە قوڵی کەوتمە ناو پڕۆگرامسازی، هەر ئەوەش وایکرد کە ئەمن نەمدەتوانی بڵێم ئێستا چ دەگوزەرێت لەلای خۆم چونکە ڕۆژ بە ڕۆژ شتەکی تازە فێردبووم.\n\n---\n\n### سەبارەت بە کەناڵی تەلەگرامەکەم\n\nزۆربەی جار پرسیاری ئەوەم لێدەکرا:  \n**لەبەرچی گرینگی بە زیادبوونی فۆڵۆوەرەکان نادەی؟**\n\nهەمووجار لەناو ناخم شتەك دروست دەبوو، ئەویش حەقیقەتی *مانیفێستەیشنی من بۆ کۆمەڵگە* یەکسانە بە ژمارەی فۆڵۆوەرەکان. ئەگەر من شتێكی پڕ بایەخ نەدەمە ناو کۆمەڵگە، فۆڵۆوەر زیادبوون شتێکی ئاسان نابێت.  \nحەزیشم نەکردووە کە بە پاڵپێوەنان شتەکان ببەمە پێشەوە. بەڵام لەگەڵ ئەوەش، بیرم لەوەی دەکردەوە کە پلاتفۆرمێکی *دروستکردنی بلۆگم* هەبێت زۆر ئاسانبێت، بتوانم خۆم *کۆنترۆلم* لەسەر هەبێت.  \nلەم پلاتفۆرمە *تێڕوانینەکانم*، بابەتە نوێگەریەکانم، تێیدا بخەمەڕوو.\n\n---\n\n### ئەمڕۆ پۆرتالی هاوکارتان پێ دەناسێنم  \n\nتێیدا دەتوانم *باشتر بیرۆکەکانم بخەمەڕوو*، باشتر پێتان بگەینم.  \n**ئەم پۆرتالە خۆم کۆدم کردووە**، زیاتریش کۆدی دەکەم، وای لێدەکەم کە ئێوە زیاتر چێژ لە خوێندنەوەی ئەم پۆرتالە وەرگرن.\n\n---\n",
        "takeaway": "دواتر بزانم ئەم ئارتیکلەکان چۆن بە شێوەیەکی باشتر پیشاندەبمەوە؟ چی پێویستە زیاد بکرێت؟",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733571460_telegram.jpg"
    },
    {
        "id": "کاتێك_دەتەوێت_سکریپتێك_لەگەڵ_چاتجیپیتی_ببەیە_پێشەوە،_قەت_ئەم_هەڵانە_مەکە",
        "title": "کاتێك دەتەوێت سکریپتێك لەگەڵ چاتجیپیتی ببەیە پێشەوە، قەت ئەم هەڵانە مەکە",
        "subtitle": "چاتجیپیتی دەتوانێت وەڵامی هەموو شتێکت بداتەوە، بەڵام ئەگەر ئاگات لێی نەبیت، وەڵامەکان دەستغەڵەتت دەدات",
        "content": "کاتێك دەکەویە گفتوگۆ، سریپتێکی داوا لێدەکەی، لەبۆت دروست دەکات، دواتر دەچیت تێستی دەکەی، دەبینی ئەم سکریپتە چەندین گرفتی هەیە، هەرگیز هەوڵمەدە داوای لێبکەی هەموو گرفتەکانی سکریپتەکەت بۆ چارەسەر بکات. باشترین ڕێگە بریتیە لەوەی کە تەنها یەك گرفت هەڵبژێریت، داوای لێبکەیت بۆت چارەسەر بکات، دوای ئەوەی کە بینیت ئەم گرفتە چارەسەربووە، ئینجا بڕۆ سەر گرفتێکیتر. کاتێك تۆ بەیەکەوە داوای لێدەکەی هەموو گرفتەکانت لەبۆ چارەسەر بکات، کارامەیی لەدەست دەدات، تەواوی ڕوحیەتی سکریپتەکەت دەگۆڕێت. بەم ڕێگایە کاتێکی زۆرتر بەسەر دەبەیت، بەڵام بەردەوام مۆدێلی سکریپتەکەت لەبەرەوپێشچوونە، زیرەکتر و کارامەتر دەبێت.\n\n\nنمونەکان\nPrompt: I like the script, but can you change the sidebar style to the button?\nPrompt: Good, now can you handle invalid inputs gracefully?\nPrompt: I like it! Now, can you allow the user to calculate squares repeatedly until they decide to stop?\n",
        "takeaway": "هەر کاتێک سکریپتێکت پێویستە، تەنها یەک گرفت دیاریبکە و داوای چارەسەری لێ بکە.\nئەوەیە باشترین ڕێگە بۆ ئەوەی سکریپتەکەت زیرەتر و کاریگەرتر بێت.\nکاتێک هەموو گرفتەکان بە یەک کات دەستنیشانبکەی، کارامەییەکان دابەزێنەوە.\nگفتوگۆکردن بە چاتجیپیتی بایدە پەیوەندیداری دروست و ڕاستەوخۆ بێت بۆ بەدەستهێنانی ئەنجامی باش.",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733588079_ai.jpg"
    },
    {
        "id": "it_is_our_tile",
        "title": "it is our tile",
        "subtitle": "here is also",
        "content": "Write your content here\n",
        "takeaway": "please",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733737739_Hawkar.jpg"
    },
    {
        "id": "it_is_a_test",
        "title": "It is a test",
        "subtitle": "Doon't take it seriously",
        "content": "Write your content here\n",
        "takeaway": "ta"
    },
    {
        "id": "i_want_to_",
        "title": "I want to ",
        "subtitle": "sa",
        "content": "Write your content here\n",
        "takeaway": "asd",
        "image_url": null
    },
    {
        "id": "it_is_",
        "title": "It is ",
        "subtitle": "sasd",
        "content": "Write your content here\n\n\n![Image Description](https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733738302_RLF CSR.jpg)",
        "takeaway": "asdv",
        "image_url": "https://raw.githubusercontent.com/habdulhaq87/news/main/photo/1733738302_RLF CSR.jpg"
    }
]